SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MG21/Include/efr32mg21_modem.h
/* Bit fields for MODEM BLEIQDSA */
#define _MODEM_BLEIQDSA_RESETVALUE                           0x00000000UL                                       /**< Default value for MODEM_BLEIQDSA            */
#define _MODEM_BLEIQDSA_MASK                                 0xFFFFFFFFUL                                       /**< Mask for MODEM_BLEIQDSA                     */
#define MODEM_BLEIQDSA_BLEIQDSAEN                            (0x1UL << 0)                                       /**< BLEIQDSA Enable                             */
#define _MODEM_BLEIQDSA_BLEIQDSAEN_SHIFT                     0                                                  /**< Shift value for MODEM_BLEIQDSAEN            */
#define _MODEM_BLEIQDSA_BLEIQDSAEN_MASK                      0x1UL                                              /**< Bit mask for MODEM_BLEIQDSAEN               */
#define _MODEM_BLEIQDSA_BLEIQDSAEN_DEFAULT                   0x00000000UL                                       /**< Mode DEFAULT for MODEM_BLEIQDSA             */
#define MODEM_BLEIQDSA_BLEIQDSAEN_DEFAULT                    (_MODEM_BLEIQDSA_BLEIQDSAEN_DEFAULT << 0)          /**< Shifted mode DEFAULT for MODEM_BLEIQDSA     */
#define _MODEM_BLEIQDSA_BLEIQDSATH_SHIFT                     1                                                  /**< Shift value for MODEM_BLEIQDSATH            */
#define _MODEM_BLEIQDSA_BLEIQDSATH_MASK                      0x7FFEUL                                           /**< Bit mask for MODEM_BLEIQDSATH               */
#define _MODEM_BLEIQDSA_BLEIQDSATH_DEFAULT                   0x00000000UL                                       /**< Mode DEFAULT for MODEM_BLEIQDSA             */
#define MODEM_BLEIQDSA_BLEIQDSATH_DEFAULT                    (_MODEM_BLEIQDSA_BLEIQDSATH_DEFAULT << 1)          /**< Shifted mode DEFAULT for MODEM_BLEIQDSA     */
#define _MODEM_BLEIQDSA_BLEIQDSAIIRCOEFPWR_SHIFT             15                                                 /**< Shift value for MODEM_BLEIQDSAIIRCOEFPWR    */
#define _MODEM_BLEIQDSA_BLEIQDSAIIRCOEFPWR_MASK              0x38000UL                                          /**< Bit mask for MODEM_BLEIQDSAIIRCOEFPWR       */
#define _MODEM_BLEIQDSA_BLEIQDSAIIRCOEFPWR_DEFAULT           0x00000000UL                                       /**< Mode DEFAULT for MODEM_BLEIQDSA             */
#define MODEM_BLEIQDSA_BLEIQDSAIIRCOEFPWR_DEFAULT            (_MODEM_BLEIQDSA_BLEIQDSAIIRCOEFPWR_DEFAULT << 15) /**< Shifted mode DEFAULT for MODEM_BLEIQDSA     */
#define _MODEM_BLEIQDSA_BLEIQDSADIFFTH1_SHIFT                18                                                 /**< Shift value for MODEM_BLEIQDSADIFFTH1       */
#define _MODEM_BLEIQDSA_BLEIQDSADIFFTH1_MASK                 0xFFFC0000UL                                       /**< Bit mask for MODEM_BLEIQDSADIFFTH1          */
#define _MODEM_BLEIQDSA_BLEIQDSADIFFTH1_DEFAULT              0x00000000UL                                       /**< Mode DEFAULT for MODEM_BLEIQDSA             */
#define MODEM_BLEIQDSA_BLEIQDSADIFFTH1_DEFAULT               (_MODEM_BLEIQDSA_BLEIQDSADIFFTH1_DEFAULT << 18)    /**< Shifted mode DEFAULT for MODEM_BLEIQDSA     */

/* Bit fields for MODEM BLEIQDSAEXT1 */
#define _MODEM_BLEIQDSAEXT1_RESETVALUE                       0x0E000000UL                                         /**< Default value for MODEM_BLEIQDSAEXT1        */
#define _MODEM_BLEIQDSAEXT1_MASK                             0x3FFFFFFFUL                                         /**< Mask for MODEM_BLEIQDSAEXT1                 */
#define _MODEM_BLEIQDSAEXT1_FREQSCALEIQDSA_SHIFT             0                                                    /**< Shift value for MODEM_FREQSCALEIQDSA        */
#define _MODEM_BLEIQDSAEXT1_FREQSCALEIQDSA_MASK              0x3UL                                                /**< Bit mask for MODEM_FREQSCALEIQDSA           */
#define _MODEM_BLEIQDSAEXT1_FREQSCALEIQDSA_DEFAULT           0x00000000UL                                         /**< Mode DEFAULT for MODEM_BLEIQDSAEXT1         */
#define MODEM_BLEIQDSAEXT1_FREQSCALEIQDSA_DEFAULT            (_MODEM_BLEIQDSAEXT1_FREQSCALEIQDSA_DEFAULT << 0)    /**< Shifted mode DEFAULT for MODEM_BLEIQDSAEXT1 */
#define MODEM_BLEIQDSAEXT1_CHPWRFIRAVGEN                     (0x1UL << 2)                                         /**< Channel Power FIR Avg Enable                */
#define _MODEM_BLEIQDSAEXT1_CHPWRFIRAVGEN_SHIFT              2                                                    /**< Shift value for MODEM_CHPWRFIRAVGEN         */
#define _MODEM_BLEIQDSAEXT1_CHPWRFIRAVGEN_MASK               0x4UL                                                /**< Bit mask for MODEM_CHPWRFIRAVGEN            */
#define _MODEM_BLEIQDSAEXT1_CHPWRFIRAVGEN_DEFAULT            0x00000000UL                                         /**< Mode DEFAULT for MODEM_BLEIQDSAEXT1         */
#define MODEM_BLEIQDSAEXT1_CHPWRFIRAVGEN_DEFAULT             (_MODEM_BLEIQDSAEXT1_CHPWRFIRAVGEN_DEFAULT << 2)     /**< Shifted mode DEFAULT for MODEM_BLEIQDSAEXT1 */
#define _MODEM_BLEIQDSAEXT1_CHPWRFIRAVGVAL_SHIFT             3                                                    /**< Shift value for MODEM_CHPWRFIRAVGVAL        */
#define _MODEM_BLEIQDSAEXT1_CHPWRFIRAVGVAL_MASK              0x18UL                                               /**< Bit mask for MODEM_CHPWRFIRAVGVAL           */
#define _MODEM_BLEIQDSAEXT1_CHPWRFIRAVGVAL_DEFAULT           0x00000000UL                                         /**< Mode DEFAULT for MODEM_BLEIQDSAEXT1         */
#define _MODEM_BLEIQDSAEXT1_CHPWRFIRAVGVAL_AVG0              0x00000000UL                                         /**< Mode AVG0 for MODEM_BLEIQDSAEXT1            */
#define _MODEM_BLEIQDSAEXT1_CHPWRFIRAVGVAL_AVG2              0x00000001UL                                         /**< Mode AVG2 for MODEM_BLEIQDSAEXT1            */
#define _MODEM_BLEIQDSAEXT1_CHPWRFIRAVGVAL_AVG4              0x00000002UL                                         /**< Mode AVG4 for MODEM_BLEIQDSAEXT1            */
#define _MODEM_BLEIQDSAEXT1_CHPWRFIRAVGVAL_AVG8              0x00000003UL                                         /**< Mode AVG8 for MODEM_BLEIQDSAEXT1            */
#define MODEM_BLEIQDSAEXT1_CHPWRFIRAVGVAL_DEFAULT            (_MODEM_BLEIQDSAEXT1_CHPWRFIRAVGVAL_DEFAULT << 3)    /**< Shifted mode DEFAULT for MODEM_BLEIQDSAEXT1 */
#define MODEM_BLEIQDSAEXT1_CHPWRFIRAVGVAL_AVG0               (_MODEM_BLEIQDSAEXT1_CHPWRFIRAVGVAL_AVG0 << 3)       /**< Shifted mode AVG0 for MODEM_BLEIQDSAEXT1    */
#define MODEM_BLEIQDSAEXT1_CHPWRFIRAVGVAL_AVG2               (_MODEM_BLEIQDSAEXT1_CHPWRFIRAVGVAL_AVG2 << 3)       /**< Shifted mode AVG2 for MODEM_BLEIQDSAEXT1    */
#define MODEM_BLEIQDSAEXT1_CHPWRFIRAVGVAL_AVG4               (_MODEM_BLEIQDSAEXT1_CHPWRFIRAVGVAL_AVG4 << 3)       /**< Shifted mode AVG4 for MODEM_BLEIQDSAEXT1    */
#define MODEM_BLEIQDSAEXT1_CHPWRFIRAVGVAL_AVG8               (_MODEM_BLEIQDSAEXT1_CHPWRFIRAVGVAL_AVG8 << 3)       /**< Shifted mode AVG8 for MODEM_BLEIQDSAEXT1    */
#define _MODEM_BLEIQDSAEXT1_CORRIIRAVGMULFACT_SHIFT          5                                                    /**< Shift value for MODEM_CORRIIRAVGMULFACT     */
#define _MODEM_BLEIQDSAEXT1_CORRIIRAVGMULFACT_MASK           0x60UL                                               /**< Bit mask for MODEM_CORRIIRAVGMULFACT        */
#define _MODEM_BLEIQDSAEXT1_CORRIIRAVGMULFACT_DEFAULT        0x00000000UL                                         /**< Mode DEFAULT for MODEM_BLEIQDSAEXT1         */
#define MODEM_BLEIQDSAEXT1_CORRIIRAVGMULFACT_DEFAULT         (_MODEM_BLEIQDSAEXT1_CORRIIRAVGMULFACT_DEFAULT << 5) /**< Shifted mode DEFAULT for MODEM_BLEIQDSAEXT1 */
#define _MODEM_BLEIQDSAEXT1_BLEIQDSAADDRBIAS_SHIFT           7                                                    /**< Shift value for MODEM_BLEIQDSAADDRBIAS      */
#define _MODEM_BLEIQDSAEXT1_BLEIQDSAADDRBIAS_MASK            0x780UL                                              /**< Bit mask for MODEM_BLEIQDSAADDRBIAS         */
#define _MODEM_BLEIQDSAEXT1_BLEIQDSAADDRBIAS_DEFAULT         0x00000000UL                                         /**< Mode DEFAULT for MODEM_BLEIQDSAEXT1         */
#define MODEM_BLEIQDSAEXT1_BLEIQDSAADDRBIAS_DEFAULT          (_MODEM_BLEIQDSAEXT1_BLEIQDSAADDRBIAS_DEFAULT << 7)  /**< Shifted mode DEFAULT for MODEM_BLEIQDSAEXT1 */
#define _MODEM_BLEIQDSAEXT1_BLEIQDSATHCOMB_SHIFT             11                                                   /**< Shift value for MODEM_BLEIQDSATHCOMB        */
#define _MODEM_BLEIQDSAEXT1_BLEIQDSATHCOMB_MASK              0x1FFF800UL                                          /**< Bit mask for MODEM_BLEIQDSATHCOMB           */
#define _MODEM_BLEIQDSAEXT1_BLEIQDSATHCOMB_DEFAULT           0x00000000UL                                         /**< Mode DEFAULT for MODEM_BLEIQDSAEXT1         */
#define MODEM_BLEIQDSAEXT1_BLEIQDSATHCOMB_DEFAULT            (_MODEM_BLEIQDSAEXT1_BLEIQDSATHCOMB_DEFAULT << 11)   /**< Shifted mode DEFAULT for MODEM_BLEIQDSAEXT1 */
#define _MODEM_BLEIQDSAEXT1_MAXCORRCNTIQDSA_SHIFT            25                                                   /**< Shift value for MODEM_MAXCORRCNTIQDSA       */
#define _MODEM_BLEIQDSAEXT1_MAXCORRCNTIQDSA_MASK             0x1E000000UL                                         /**< Bit mask for MODEM_MAXCORRCNTIQDSA          */
#define _MODEM_BLEIQDSAEXT1_MAXCORRCNTIQDSA_DEFAULT          0x00000007UL                                         /**< Mode DEFAULT for MODEM_BLEIQDSAEXT1         */
#define MODEM_BLEIQDSAEXT1_MAXCORRCNTIQDSA_DEFAULT           (_MODEM_BLEIQDSAEXT1_MAXCORRCNTIQDSA_DEFAULT << 25)  /**< Shifted mode DEFAULT for MODEM_BLEIQDSAEXT1 */
#define MODEM_BLEIQDSAEXT1_IIRRST                            (0x1UL << 29)                                        /**< IIR Reset                                   */
#define _MODEM_BLEIQDSAEXT1_IIRRST_SHIFT                     29                                                   /**< Shift value for MODEM_IIRRST                */
#define _MODEM_BLEIQDSAEXT1_IIRRST_MASK                      0x20000000UL                                         /**< Bit mask for MODEM_IIRRST                   */
#define _MODEM_BLEIQDSAEXT1_IIRRST_DEFAULT                   0x00000000UL                                         /**< Mode DEFAULT for MODEM_BLEIQDSAEXT1         */
#define MODEM_BLEIQDSAEXT1_IIRRST_DEFAULT                    (_MODEM_BLEIQDSAEXT1_IIRRST_DEFAULT << 29)           /**< Shifted mode DEFAULT for MODEM_BLEIQDSAEXT1 */

